# RelinquishOptions Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RelinquishOptions Members
RelinquishOptions Class Constructors Methods Properties See Also
---
The RelinquishOptions type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| RelinquishOptions | Constructs a new instance of RelinquishOptions. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the RelinquishOptions |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CheckedOutElements | True means all elements checked out by the current user should be relinquished. False means none of these are relinquished. |
| FamilyWorksets | True means all family worksets owned by the current user should be relinquished. False means none of these are relinquished. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| StandardWorksets | True means all project standards worksets owned by the current user should be relinquished. False means none of these are relinquished. |
| UserWorksets | True means all user-created worksets owned by the current user should be relinquished. False means none of these are relinquished. |
| ViewWorksets | True means all view worksets owned by the current user should be relinquished. False means none of these are relinquished. |

# See Also
RelinquishOptions Class
Autodesk.Revit.DB Namespace